artillery/test.yml
config:
  target: "https://postman-echo.com/"
  phases:
    - duration: 15
      arrivalRate: 10
      name: Artillery My Low Speed Test
  payload:
    - path: "keywords.csv"
      fields:
        - "keyword1"
        - "keyword2"
      order: sequence
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 500
    conditions:
      - expression: vusers.failed == 0
      - expression: "http.request_rate >= 2 and http.response_time.max < 1000"
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"
          json:
            foo1: "bar1"
            foo2: "bar2"